Revit 2027 API
FilledRegionType.IsValidLineWeight Method
 Indicates whether the given line weight value is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidLineWeight(
	int lineWeight
)
Public Shared Function IsValidLineWeight (
	lineWeight As Integer
) As Boolean
public:
static bool IsValidLineWeight(
	int lineWeight
)
static member IsValidLineWeight :
        lineWeight : int -> bool
Parameters
lineWeight Int32
 The line weight.
Return Value
Boolean
 True if it is a valid line weight value, false otherwise.
See Also
Reference
FilledRegionType Class
Autodesk.Revit.DB Namespace